рассказ минут на 10
лессонс лернт
особенности работы с новым заказчиком, куда пригласил свой человек
фокус не на азию


составление договора -не стоит полагаться на человека, внимательнее подходить к составлению договора
проверяться условия рассторжения
проверять обязательства - не стестняться выставлять, проверять, четко прописывать последствия в $$, в снижении объема
найти баланс 
читать, читать договор и выполняйте, представьте, что вызовут в суд. даже если во время выполнения все хорошо, при любом разбирательстве не до дружбы и предится ссылаться на пункты договора
не делать слишком большие куски - если заказчик просит объединить работы
	не оставляйте самый большой кусок на последний платеж - сказать про мотивацию заказчика не принимать последнюю работу
	если сумма этапа и объем работ не связаны напрямую, делайте первые этапы самыми большими по деньгам
авансовый платеж не всегда хорошо - могут потребовать вернуть
если с вами в договоре есть партнеры, как РП узнайте, что они делают, какиая зона ответственности, сколько платят и как от этого уменьшится ваш бюджет
у нас была зависимость от лицензий, заказчик отказался, партнер потерял деньги, в результате мы отдаем партнеру больший процент - надо было трясти из заказчика

общий посыл - не принимайте договор, спеки и ДУ как данность. у вас есть возможность на это влиять и вам с этим работать

выполнение проекта
фикс прайс - минимальные деньги и сроки с удовлетворительным качеством - это оцель
что-то пошло не так:
не спешить с выоводом команды - была дримтим, которая готова была ебашить, а заказчик решил начать с процесса -> команда в 4 дорогих человека (нашему сердцу) человека была в полупростое
лучше потом нагнать, чем просрать деньги
как РП проверьте, что у вас есть все необходимое для старта работ со стороны заказчика стенд для НТ ждали 4 месяца
декомпозируйте работы
не стоит всеми силами выполнять работу: пошли на компромисс, записали скрипты на ЮАТ, для НТ пришлось переписывать
адекватно оценивайте свои силы
учитывайте у заказчик нналажены процессы и вашего РП от заказчика - на организацию сетевых доступов ушло 2 недели чистового времени РП за проект
будьте готовы, что вам придется выполянть работу от РП от зказчика - чем раньше вы это поймете, тем лучше
согласования - понимайте кто - должен быть один человек, понимайте когда - ставьте жесткие сроки
если процесс идет медленно, оптимизируйте - либо не те люди, либо много отделов со своими интересами, либо загружены - проверяйте, что люди выделены на работы в вашим проекте
либо берите ответственность и продавайте заказчику свое решение - жестко говорите, что сценарии будут выглядеть так
не бойтесь портить отношения и жестко отстаивать свою позицию
от повторения результат не меняется
в фиксе вам придется управлять не только своей командой, но и заказчиком - отдавать отчет, сотрудники заказчика по факту ничего не должны
отслеживайте темп выполнения проекта - даже если кажется, что все ок. регулряно трекайте, сколько потрачено денег, сколько работы выполнено, сходятся ли эти темпы. лучше, если этой информацией будете обладать не только вы, но и куратор, МП и инногда даже заказчик
не стесняйтся поднимать вопрос о пересмотре ожидаемых результатов


ЭСКАЛИРУЙТЕ - жестко, не бойтесь обидеть, понимать кто спонсор проекта и кто принимает решения, регулярно с ним встречаться
	эскалация это информирование, она станет поддержкой, это не скандал. средство поднести мысль и потом поддержать
	процесс не двигается, что-то идет не по плану
	понимать пищевую цепочку
Эскалация - не только сказать, но быть готовым выполнять. В момент эскалации вы становитесь отвественным за проблему.
Структирировано - мы так думаем. Таблицы. Сжато и лаконично.

не бояться
не увлекаться
эскалация может быть проигнорирована - это не значит, что она не была прочитана, ищите другие способы выхода на более высокий уровень. письмо должно быть в любом случае



Фиксируйте все изменения и результаты встречи. Если просил заказчик что-то изменить, работать по-другому - пишете, что заказчик просил изменить. В лушчем случае письма не понадобятся, в худшем ы эти письма вытащите. Ссылайтесь на разговор.

Презентации и регулярная отчетность - когда готовите по своим работам, по своим проблемам и болям, с указанием того, почему вы не можете выполнять свою работу. Топ-менеджер должен понять проблему и решить проблему у себя. Не ведитесь на ложную помощь РП от заказчика с ровной презой. Указывайте отвественных. 

не забывайте о формальной стороне вопроса - если есть не IT, включайте их - читайте договор, кто должен быть информирован (пример с Thai Vu)


привязывать оплату к конкретным услугам - выполнение работ и обучение разбивайте на разные, так как одну из услуг могут не принять
обучение - прописывайте четко время оказания услуги, ограничения сверху
ретроспектива
	планы, сроки изначальные, прибыль 30% + расширение бизнеса + доп. услуги
	факт - срок + столько-то месяцев, выполнено 80% работ, такие-то деньги